---
kind: type
id: T:Autodesk.Revit.DB.ContourSettingItem
source: html/00e30bf2-47ec-6c3b-93a0-32fb70b6bf9c.htm
---
# Autodesk.Revit.DB.ContourSettingItem

Contour setting item that stores the information of a single contour or a set of contours.

## Syntax (C#)
```csharp
public class ContourSettingItem : IDisposable
```